In [2]:
import pandas as pd

In [3]:
data1 = {'Name': ['Tom', 'Joseph', 'Bob'], 'Age': [20, 21, 19],'Category': ['A', 'B', 'A']}

df1 = pd.DataFrame(data1)
df1

     Name  Age Category
0     Tom   20        A
1  Joseph   21        B
2     Bob   19        A

In [4]:
df1.groupby('Category')['Age'].mean() ##categoryごとの年齢の平均

Category
A    19.5
B    21.0
Name: Age, dtype: float64

In [5]:
df1.groupby('Category')['Age'].sum() ##categoryごとの年齢の合計

Category
A    39
B    21
Name: Age, dtype: int64

In [6]:
df1["Sales"] = [200,300,400]
df1

     Name  Age Category  Sales
0     Tom   20        A    200
1  Joseph   21        B    300
2     Bob   19        A    400

In [7]:
pd.crosstab(df1['Category'],df1['Age']) ##categoryごとの年齢のクロス集計

Age       19  20  21
Category
A          1   1   0
B          0   0   1

In [8]:
df1["Gender"] = ["M","F","M"]
df1

     Name  Age Category  Sales Gender
0     Tom   20        A    200      M
1  Joseph   21        B    300      F
2     Bob   19        A    400      M

In [9]:
df1.pivot_table(index='Category', columns="Gender", values="Age", aggfunc="mean") ##categoryごとの性別別の年齢の平均のピボットテーブル
## (index=行, columns=列, values=集計する値, aggfunc=集計方法)

Gender       F     M
Category
A          NaN  19.5
B         21.0   NaN

In [17]:
data3 = ["2024-01-01","2024-01-02","2024-01-03"]
data3_Date = pd.to_datetime(data3) ##日付型(datetime64型)に変換してdata3_Dateに格納
df1["Date"] = data3_Date ##data3_Dateをdf1に追加
df1

     Name  Age Category  Sales Gender       Date
0     Tom   20        A    200      M 2024-01-01
1  Joseph   21        B    300      F 2024-01-02
2     Bob   19        A    400      M 2024-01-03

In [11]:
df1["Date"].dt.year ##年を取得

0    2024
1    2024
2    2024
Name: Date, dtype: int32

In [12]:
df1["Date"].dt.day ##日を取得

0    1
1    2
2    3
Name: Date, dtype: int32

In [27]:
data = "data/wholesale_customers-tab.csv"
df = pd.read_csv(data,sep="\t",skiprows=2) ##データの読み込みに注意
display(df.head(12))

,Channel,Region,Fresh,Milk,Grocery,Frozen,Detergents_Paper,Delicatessen
0,2,Other,12669,9656,7561,214,2674,1338
1,2,Other,7057,9810,9568,1762,3293,1776
2,2,Other,6353,8808,7684,2405,3516,7844
3,1,Other,13265,1196,4221,6404,507,1788
4,2,Other,22615,5410,7198,3915,1777,5185
5,2,Other,9413,8259,5126,666,1795,1451
6,2,Other,12126,3199,6975,480,3140,545
7,2,Other,7579,4956,9426,1669,3321,2566
8,1,Other,5963,3648,6192,425,1716,750
9,2,Other,6006,11093,18881,1159,7425,2098
10,2,Other,3366,5403,12974,4400,5977,1744
11,2,Other,13146,1124,4523,1420,549,497

In [28]:
df["Channel"].value_counts() ##Channelの値のカウント

Channel
1    298
2    142
Name: count, dtype: int64

In [29]:
df["Region"].value_counts() ##Regionの値のカウント

Region
Other     316
Lisbon     77
Oporto     47
Name: count, dtype: int64